<?xml version="1.0" ?>
<net name="my_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1000,1,32,128" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="batch_normalization_1/cond/FusedBatchNorm/mean/Fused_Mul_57305732_const" type="Const" version="opset1">
			<data offset="0" size="3200" shape="32,1,5,5" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,2" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_5400/copy_const" type="Const" version="opset1">
			<data offset="3200" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2d_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="batch_normalization_2/cond/FusedBatchNorm/mean/Fused_Mul_57345736_const" type="Const" version="opset1">
			<data offset="3328" size="204800" shape="64,32,5,5" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv2d_2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,2" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_54035408/copy_const" type="Const" version="opset1">
			<data offset="208128" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2d_2/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="batch_normalization_3/cond/FusedBatchNorm/mean/Fused_Mul_57385740_const" type="Const" version="opset1">
			<data offset="208384" size="819200" shape="128,64,5,5" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2d_3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_54115416/copy_const" type="Const" version="opset1">
			<data offset="1027584" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv2d_3/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="batch_normalization_4/cond/FusedBatchNorm/mean/Fused_Mul_57425744_const" type="Const" version="opset1">
			<data offset="1028096" size="1179648" shape="256,128,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2d_4/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_54195424/copy_const" type="Const" version="opset1">
			<data offset="2207744" size="1024" shape="1,256,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2d_4/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="activation_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="batch_normalization_5/cond/FusedBatchNorm/mean/Fused_Mul_57465748_const" type="Const" version="opset1">
			<data offset="2208768" size="4718592" shape="512,256,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv2d_5/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_54275432/copy_const" type="Const" version="opset1">
			<data offset="6927360" size="2048" shape="1,512,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2d_5/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="activation_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2d_6/kernel/read/Output_0/Data__const" type="Const" version="opset1">
			<data offset="6929408" size="1310720" shape="40,512,4,4" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2d_6/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2d_6/bias/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data offset="8240128" size="160" shape="1,40,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2d_6/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2d_6/BiasAdd/Add/Transpose/Cast_111340_const" type="Const" version="opset1">
			<data offset="8240288" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2d_6/BiasAdd/Add/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="flatten_1/stack/ExpandDims_/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240320" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="flatten_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="flatten_1/Shape/GatherNCHWtoNHWC/Cast_111254_const" type="Const" version="opset1">
			<data offset="8240324" size="16" shape="4" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="flatten_1/Shape/GatherNCHWtoNHWC/Cast_211256_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="flatten_1/Shape/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="flatten_1/strided_slice/Cast_111274_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="flatten_1/strided_slice/Cast_211276_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="flatten_1/strided_slice/Cast_311278_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="flatten_1/strided_slice" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0" begin_mask="0" end_mask="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="flatten_1/Prod/Cast_111230_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="flatten_1/Prod" type="ReduceProd" version="opset1">
			<data keep_dims="False"/>
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="43" name="flatten_1/stack/ExpandDims_439/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="flatten_1/stack/ExpandDims_439/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="flatten_1/stack/Concat_" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="flatten_1/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="flatten_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="dense_1/MatMul/1_port_transpose7780_const" type="Const" version="opset1">
			<data offset="8240356" size="1310720" shape="8192,40" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>8192</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>8192</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="dense_1/bias/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data offset="9551076" size="32768" shape="1,8192" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="dense_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>8192</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="reshape_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="reshape_1/strided_slice/Cast_111172_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="reshape_1/strided_slice/Cast_211174_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="reshape_1/strided_slice/Cast_311176_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="reshape_1/strided_slice" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="57" name="reshape_1/Reshape/shape/ExpandDims_/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="reshape_1/Reshape/shape/ExpandDims_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="reshape_1/Reshape/shape/ExpandDims_447/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="9583844" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="reshape_1/Reshape/shape/ExpandDims_448/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="9583844" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="reshape_1/Reshape/shape/ExpandDims_449/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="9583848" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="reshape_1/Reshape/shape/Concat_" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="reshape_1/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="reshape_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>8192</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="reshape_1/Reshape/Transpose/Cast_111244_const" type="Const" version="opset1">
			<data offset="9583852" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="reshape_1/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="batch_normalization_6/cond/FusedBatchNorm/mean/Fused_Mul_57505752_const" type="Const" version="opset1">
			<data offset="9583884" size="4718592" shape="512,256,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv2d_transpose_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv2d_transpose_1/Shape/GatherNCHWtoNHWC/Cast_111308_const" type="Const" version="opset1">
			<data offset="8240324" size="16" shape="4" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv2d_transpose_1/Shape/GatherNCHWtoNHWC/Cast_211310_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="71" name="conv2d_transpose_1/Shape/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv2d_transpose_1/strided_slice/Cast_111146_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv2d_transpose_1/strided_slice/Cast_211148_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv2d_transpose_1/strided_slice/Cast_311150_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv2d_transpose_1/strided_slice" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="76" name="conv2d_transpose_1/stack/ExpandDims_/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv2d_transpose_1/stack/ExpandDims_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv2d_transpose_1/strided_slice_1/Cast_111158_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2d_transpose_1/strided_slice_1/Cast_211160_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2d_transpose_1/strided_slice_1/Cast_311162_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2d_transpose_1/strided_slice_1" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="82" name="conv2d_transpose_1/mul/y/Output_0/Data__const" type="Const" version="opset1">
			<data offset="14302484" size="4" shape="" element_type="i32"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="83" name="conv2d_transpose_1/mul" type="Multiply" version="opset1">
			<input>
				<port id="0"/>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="84" name="conv2d_transpose_1/stack/ExpandDims_452/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv2d_transpose_1/stack/ExpandDims_452/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv2d_transpose_1/strided_slice_2/Cast_111332_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv2d_transpose_1/strided_slice_2/Cast_211334_const" type="Const" version="opset1">
			<data offset="14302488" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv2d_transpose_1/strided_slice_2/Cast_311336_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv2d_transpose_1/strided_slice_2" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="90" name="conv2d_transpose_1/mul_1/y/Output_0/Data__const" type="Const" version="opset1">
			<data offset="14302484" size="4" shape="" element_type="i32"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="91" name="conv2d_transpose_1/mul_1" type="Multiply" version="opset1">
			<input>
				<port id="0"/>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="92" name="conv2d_transpose_1/stack/ExpandDims_453/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv2d_transpose_1/stack/ExpandDims_453/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv2d_transpose_1/stack/ExpandDims_454/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="14302496" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv2d_transpose_1/stack/Concat_" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv2d_transpose_1/conv2d_transpose/GatherNHWCtoNCHW/Cast_111270_const" type="Const" version="opset1">
			<data offset="14302500" size="16" shape="4" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="conv2d_transpose_1/conv2d_transpose/GatherNHWCtoNCHW/Cast_211272_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="conv2d_transpose_1/conv2d_transpose/GatherNHWCtoNCHW" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv2d_transpose_1/conv2d_transpose/ss_0_port/Cast_111166_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv2d_transpose_1/conv2d_transpose/ss_0_port/Cast_211168_const" type="Const" version="opset1">
			<data offset="14302516" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv2d_transpose_1/conv2d_transpose/ss_0_port/Cast_311170_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv2d_transpose_1/conv2d_transpose/ss_0_port" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0" begin_mask="0" end_mask="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv2d_transpose_1/conv2d_transpose/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="conv2d_transpose_1/conv2d_transpose" type="ConvolutionBackpropData" version="opset1">
			<data dilations="1,1" strides="2,2" auto_pad="same_lower"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_add_54355440/copy_const" type="Const" version="opset1">
			<data offset="14302524" size="1024" shape="1,256,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv2d_transpose_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="activation_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="batch_normalization_7/cond/FusedBatchNorm/mean/Fused_Mul_57545756_const" type="Const" version="opset1">
			<data offset="14303548" size="1179648" shape="256,128,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv2d_transpose_2/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="conv2d_transpose_2/Shape/GatherNCHWtoNHWC/Cast_111286_const" type="Const" version="opset1">
			<data offset="8240324" size="16" shape="4" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv2d_transpose_2/Shape/GatherNCHWtoNHWC/Cast_211288_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="112" name="conv2d_transpose_2/Shape/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="conv2d_transpose_2/strided_slice/Cast_111238_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="conv2d_transpose_2/strided_slice/Cast_211240_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="conv2d_transpose_2/strided_slice/Cast_311242_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="conv2d_transpose_2/strided_slice" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="117" name="conv2d_transpose_2/stack/ExpandDims_/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="conv2d_transpose_2/stack/ExpandDims_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="conv2d_transpose_2/strided_slice_1/Cast_111204_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="conv2d_transpose_2/strided_slice_1/Cast_211206_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="conv2d_transpose_2/strided_slice_1/Cast_311208_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="conv2d_transpose_2/strided_slice_1" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="123" name="conv2d_transpose_2/mul/y/Output_0/Data__const" type="Const" version="opset1">
			<data offset="14302484" size="4" shape="" element_type="i32"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="124" name="conv2d_transpose_2/mul" type="Multiply" version="opset1">
			<input>
				<port id="0"/>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="125" name="conv2d_transpose_2/stack/ExpandDims_442/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="conv2d_transpose_2/stack/ExpandDims_442/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="conv2d_transpose_2/strided_slice_2/Cast_111232_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="conv2d_transpose_2/strided_slice_2/Cast_211234_const" type="Const" version="opset1">
			<data offset="14302488" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="conv2d_transpose_2/strided_slice_2/Cast_311236_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="conv2d_transpose_2/strided_slice_2" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" begin_mask="0" end_mask="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32"/>
			</output>
		</layer>
		<layer id="131" name="conv2d_transpose_2/mul_1/y/Output_0/Data__const" type="Const" version="opset1">
			<data offset="14302484" size="4" shape="" element_type="i32"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="132" name="conv2d_transpose_2/mul_1" type="Multiply" version="opset1">
			<input>
				<port id="0"/>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="133" name="conv2d_transpose_2/stack/ExpandDims_443/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="conv2d_transpose_2/stack/ExpandDims_443/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="conv2d_transpose_2/stack/ExpandDims_444/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data offset="15483196" size="4" shape="1" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="conv2d_transpose_2/stack/Concat_" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="conv2d_transpose_2/conv2d_transpose/GatherNHWCtoNCHW/Cast_111290_const" type="Const" version="opset1">
			<data offset="14302500" size="16" shape="4" element_type="i32"/>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="conv2d_transpose_2/conv2d_transpose/GatherNHWCtoNCHW/Cast_211292_const" type="Const" version="opset1">
			<data offset="8240340" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="139" name="conv2d_transpose_2/conv2d_transpose/GatherNHWCtoNCHW" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="conv2d_transpose_2/conv2d_transpose/ss_0_port/Cast_111298_const" type="Const" version="opset1">
			<data offset="14302476" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="conv2d_transpose_2/conv2d_transpose/ss_0_port/Cast_211300_const" type="Const" version="opset1">
			<data offset="14302516" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="conv2d_transpose_2/conv2d_transpose/ss_0_port/Cast_311302_const" type="Const" version="opset1">
			<data offset="8240348" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="conv2d_transpose_2/conv2d_transpose/ss_0_port" type="StridedSlice" version="opset1">
			<data new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0" begin_mask="0" end_mask="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="conv2d_transpose_2/conv2d_transpose/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="conv2d_transpose_2/conv2d_transpose" type="ConvolutionBackpropData" version="opset1">
			<data dilations="1,1" strides="2,2" auto_pad="same_lower"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1000</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="data_add_54435448/copy_const" type="Const" version="opset1">
			<data offset="15483200" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
